In [102]:
import pandas as pd
import sqlite3

In [103]:
# Import SQLite3 database 
database = sqlite3.connect("D:\python-data-science\week8\dataset\petstore.db")

In [104]:
df = pd.read_sql_query('SELECT name FROM sqlite_master WHERE type="table";', database)
df

                name
0               pets
1             owners
2  procedure_history
3  procedure_details

In [105]:
df = pd.read_sql_query('SELECT * FROM owners;',database)
df.head()

,id,name,surname,street_address,city,state,state_full,zip_code
0,6049,Debbie,Metivier,315 Goff Avenue,Grand Rapids,MI,Michigan,49503
1,2863,John,Sebastian,3221 Perry Street,Davison,MI,Michigan,48423
2,3518,Connie,Pauley,1539 Cunningham Court,Bloomfield Township,MI,Michigan,48302
3,3663,Lena,Haliburton,4217 Twin Oaks Drive,Traverse City,MI,Michigan,49684
4,1070,Jessica,Velazquez,3861 Woodbridge Lane,Southfield,MI,Michigan,48034

In [106]:
df = pd.read_sql_query('SELECT *FROM procedure_details;', database)
                       
df.head()

          type  sub_code  description  price
0  OFFICE FEES         1  Office Call     32
1  OFFICE FEES         2    Emergency    100
2  OFFICE FEES         3         Reck     24
3     GROOMING         1         Bath     15
4     GROOMING         2     Flea Dip     15

In [113]:
df = pd.read_sql_query('SELECT * owner_id FROM pets;', database)
df

DatabaseError: Execution failed on sql 'SELECT * owner_id FROM pets;': near "owner_id": syntax error

In [74]:
# Exercise 1: Get the days in the month where VACCINATIONS are done for dogs
df = pd.read_sql_query('SELECT strftime ("%Y", date) AS year FROM procedure_history WHERE type="VACCINATIONS";',database)

In [75]:
# Exercise 2: Get all Procedures types done after the day 15 of the month
df = pd.read_sql_query('SELECT date FROM procedure_history WHERE strftime("%d", date) >"15";',database)

In [76]:
# Exercise 3: Get the average price, max and min for each Procedure type
df = pd.read_sql_query('SELECT AVG(price) FROM procedure_details WHERE "PRICE";', database)
df

   AVG(price)
0  195.390244

In [60]:
df = pd.read_sql_query('SELECT MAX(price) FROM procedure_details;', database)
df

   MAX(price)
0         775

In [62]:
df = pd.read_sql_query('SELECT MIN(price) FROM procedure_details;', database)
df

   MIN(price)
0          10

In [119]:
# Exercise 4: Get owners of pets with Procedures
df = pd.read_sql_query('SELECT pets.id, owners.id FROM procedure_history INNERJOIN id ON pets.id=id.owners;, database) INNERJOIN Procedures ON pets procedures_details;',database)

DatabaseError: Execution failed on sql 'SELECT pets.id, owners.id FROM procedure_history INNERJOIN id ON pets.id=id.owners;, database) INNERJOIN Procedures ON pets procedures_details;': near "id": syntax error

In [ ]:
# Exercise 5: Get pets without Procedures

In [ ]:
# Exercise 6: Get the amount of money coming from VACCINATIONS (by month)

In [ ]:
# Exercise 7: Check which Procedures are not in the history

In [ ]:
# Exercise 8: What kind of pet have more procedures overall?

In [ ]:
# Exercise 9: How much revenue per month is brought by each procedure?

In [ ]:
# Exercise 10: Which pet kind and gender bring more revenue?